/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "O conteúdo selecionado não pôde ser reproduzido.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Não foi possível encontrar nenhum conteúdo.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Não foi possível reproduzir a música atual.";


/* kBRMediaNoContent*/
300 = "Nenhum conteúdo foi encontrado.";

/* kBRMediaNoPhotoContent */
301 = "Não existem fotos na sua Fototeca do iPhoto.";

/* kBRMediaNoPodcastContent */
302 = "Não existem podcasts na sua Biblioteca do iTunes.";

/* kBRMediaNotDRMAuthorized */
303 = "Você não tem autorização para reproduzir este conteúdo.";

/* kBRMediaNoMovieFolderContent */
304 = "Não existem filmes para reproduzir na sua pasta Filmes.";

/* kBRMediaNoTVShowContent */
305 = "Não existem Programas de TV na sua Biblioteca do iTunes.";

/* kBRMediaNoMusicVideoContent */
306 = "Não há videoclipes na sua biblioteca do iTunes.";

/* kBRMediaNoPlaylists */
307 = "Não existem listas na sua Biblioteca do iTunes.";

/* kBRMediaNoSongContent */
308 = "Não existem músicas na sua Biblioteca do iTunes.";

/* kBRMediaNoAudioBookContent */
309 = "Não há audiolivros na sua Biblioteca do iTunes.";

/* kBRMediaEmptyPlaylist */
310 = "Não há músicas nesta lista.";

/* kBRMediaNoSuchPlaylist */
311 = "A lista selecionada não foi encontrada.";

/* kBRMediaNoSuchSong */
312 = "A música selecionada não foi encontrada.";

/* kBRMediaNoMovies */
315 = "Não existem filmes na sua pasta Filmes.";

/* kBRMediaNoSongForSlideshow */
316 = "A música para esta apresentação de slides não pôde ser reproduzida.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "A música para esta apresentação de slides não pôde ser reproduzida.";

/* kBRVideoUnplayable */
318 = "O vídeo selecionado não pôde ser reproduzido.";

/* kBRMediaRadioStreamUnplayable */
319 = "A transmissão em tempo real do rádio que você selecionou não pôde ser reproduzida.";

/* kBRRemoteMediaNoContent*/
350 = "Nenhum conteúdo foi encontrado nesta biblioteca.";

/* kBRRemoteMediaNoPhotoContent */
351 = "Não há fotos nesta biblioteca.";

/* kBRRemoteMediaNoPodcastContent */
352 = "Não há podcasts nesta biblioteca.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "Você não tem autorização para reproduzir este conteúdo.";

/* kBRRemoteMediaNoTVShowContent */
355 = "Não há Programas de TV nesta biblioteca.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "Não há videoclipes nesta biblioteca.";

/* kBRRemoteMediaNoPlaylists */
357 = "Não há listas nesta biblioteca.";

/* kBRRemoteMediaNoSongContent */
358 = "Não há músicas nesta biblioteca.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "Não há audiolivros nesta biblioteca.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "Não há músicas nesta lista.";

/* kBRRemoteMediaLoadingError */
361 = "Ocorreu um erro ao carregar este conteúdo.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "A fonte de compartilhamento de fotos não está disponível.";

/* kBRDataSourceInitializationFailure*/
400 = "Nenhum conteúdo foi encontrado.";

/* kBRDataSourceURLResolutionFailure*/
410 = "Nenhum conteúdo foi encontrado.";

/* kBRDataSourceConnectionInProgressError */
420 = "Já existe uma tentativa de conexão a esta fonte.";


/* KBRSystemNetworkHostUnreachable */
501 = "Não foi possível conectar-se a esta biblioteca.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "O trailer de filme não pode ser reproduzido neste momento.";

/* kBRSystemNotHDCPCompliant */
503 = "Este conteúdo requer HDCP para ser reproduzido.";

/* kBRSetupCantSetLanguage */
600 = "O idioma não pôde ser alterado.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "Não é possível reproduzir um DVD neste momento.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "O DVD não pode ser ejetado.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "O código de região do DVD não coincide com o reprodutor de DVD.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "O DVD não pode ser reproduzido.";

/* kBRDVDErrorFatalDVDAlert */
754 = "O DVD não pode ser reproduzido.";

/* kBRCDErrorCantEjectCDAlert */
755 = "O CD não pode ser ejetado.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "A proteção contra cópia do disco não pode ser verificada.";

/* kBRInternalResourceError */
900 = "Ocorreu um erro.";

